Autodesk.Revit.DB.SketchPlane.GetPlaneReference
Returns a reference to this element as a plane.
Remarks:
The object returned here can be used with the Autodesk.Revit.DB.PointOnPlane class.
Returns:
The reference.
Since:
2014

Autodesk.Revit.DB.SketchPlane.GetPlane
Returns the corresponding Plane.
Returns:
The plane upon which elements created with this sketch plane will lie.
Since:
2014

Autodesk.Revit.DB.SketchPlane.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a sketch plane from a grid, reference plane, or level.
document:
The document.
datumId:
The id of the grid, reference plane, or level.
Returns:
The newly created sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
datumId is not a valid Element identifier.
-or-
ElementId must correspond to a grid, reference plane, or level.
-or-
ElementId must correspond to a non-curved datum.
-or-
Sketch plane creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.SketchPlane.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Creates a new sketch plane from a reference to a planar face.
Remarks:
A reference relationship will be created between the face and the sketch plane.
document:
The document.
planarFaceReference:
The reference of the planar face where the sketch plane will be created.
Returns:
The newly created sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Sketch plane creation is not allowed in this family.
-or-
The reference is not a planar face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.SketchPlane.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Plane)
Creates a new sketch plane from a geometric plane.
Remarks:
There will not be a reference relationship established from the sketch plane to the input face. To create a SketchPlane with a reference to other geometry,
use the overload with a Reference input.
document:
The document.
plane:
The geometry plane where the sketch plane will be created.
Returns:
The newly created sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Sketch plane creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.SketchPlane.IsSuitableForModelElements
Identifies if the sketch plane can be assigned to model elements.
Remarks:
Sketch planes with this property set to true are suitable to be used to create model elements. Planes where this property is false will be rejected when used to create model curves, symbolic curves, generic forms, or other sketched elements.

Autodesk.Revit.DB.SketchPlane
Represents a sketch plane or work plane.
Remarks:
A SketchPlane object is used as an input to creation of sketch-referencing elements such as Model Curves or sketch-owning elements such as Generic Forms.  The SketchPlane can be obtained from an existing element or created from a geometric plane or planar face.  Note that the sketch plane element passed as input to create an element may not be the actual sketch plane assigned to that element; Revit may look for a geometrically equivalent plane to use, or may create a new one if the input plane is already used for other purposes.  Some sketch planes (such as those obtained from detail curves) are suitable only for use in creating detail elements; they will be rejected when used for other element types.